src/cfe/osn/InformationRegisters/_ЗаказЗакупка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_ЗаказЗакупка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбработанЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбработанаЗаявка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаЗакупку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаЗакупку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьРасхожденияОрдерНакладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереданРанее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/СтатусыЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяОбеспечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГотовКОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/СтатусыВнутреннихЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыВнутреннихЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/osn/Documents/ЗаказНаВнутреннееПотребление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаВнутреннееПотребление</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_ЗаявкаНаЗакупку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаЗакупку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_УИДЗаказ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_Отгрузка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_УИДОтгрузка</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/osn/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантПредставленияНабораВПечатныхФормах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПредставленияНаборовВПечатныхФормах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантРасчетаЦеныНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЦенНаборов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/osn/CommonModules/_ОбработкаЗакупкиСервер/Ext/Module.bsl
#Область ОбработкаДокументаЗакупки

&НаСервере
Функция ПолучитьТоваыЗаявкиНаЗакупку(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаЗакупкуТовары.Ссылка КАК Ссылка,
	               |	ЗаявкаНаЗакупкуТовары.НомерСтроки КАК НомерСтроки,
	               |	ЗаявкаНаЗакупкуТовары.Номенклатура КАК Номенклатура,
	               |	ЗаявкаНаЗакупкуТовары.Характеристика КАК Характеристика,
	               |	ЗаявкаНаЗакупкуТовары.Количество КАК Количество,
	               |	ЗаявкаНаЗакупкуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ЗаявкаНаЗакупкуТовары.Упаковка КАК Упаковка,
	               |	ЗаявкаНаЗакупкуТовары.КодСтроки КАК КодСтроки,
	               |	ЗаявкаНаЗакупкуТовары._УИДЗаказ КАК _УИДЗаказ,
	               |	ЗаявкаНаЗакупкуТовары._НоменклатураКомплект КАК _НоменклатураКомплект,
	               |	ЗаявкаНаЗакупкуТовары._КоличествоУпаковокКомплекта КАК _КоличествоУпаковокКомплекта
	               |ИЗ
	               |	Документ.ЗаявкаНаЗакупку.Товары КАК ЗаявкаНаЗакупкуТовары
	               |ГДЕ
	               |	ЗаявкаНаЗакупкуТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьТоваыЗаявкиНаОтгрузку()
  
&НаСервере
Функция ОтборДанныхПоДокументу(Объект, КлючУникальности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаЗакупку.Ссылка КАК ЗаявкаНаЗакупку,
	               |	ЗаявкаНаЗакупку.ДокументОснование КАК ЗаказКлиента,
	               |	&КлючУникальности КАК GUID
	               |ИЗ
	               |	Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	               |ГДЕ
	               |	ЗаявкаНаЗакупку.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",			  Объект.Ссылка);
	Запрос.УстановитьПараметр("КлючУникальности", КлючУникальности);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ОтборДанныхПоДокументу()

&НаСервере
Процедура СформироватьЗаписиРегистра_ЗаказЗакупка(Объект, КлючУникальности , Удаление = Ложь, Выбран = Ложь, ОбработанЗаказ = Ложь, ОбработанаЗаявка = Ложь)Экспорт
	
	Если ( ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаявкаНаЗакупку") ) ИЛИ ( ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаявкаНаЗакупку") ) Тогда
		Если НЕ Выбран Тогда
			Если НЕ Удаление Тогда 
				Результат = ОтборДанныхПоДокументу(Объект, КлючУникальности);
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					НаборЗаписей = РегистрыСведений._ЗаказЗакупка.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(НаборЗаписей, Выборка);
					НаборЗаписей.ОбработанЗаказ = ОбработанЗаказ;
					НаборЗаписей.Записать();
				КонецЦикла;
			Иначе			//Удаление
				НаборЗаписей = РегистрыСведений._ЗаказЗакупка.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.GUID.Установить(КлючУникальности);
				НаборЗаписей.Записать();
			КонецЕсли;		//Удаление
		Иначе			//НЕ Выбран
			НаборЗаписей = РегистрыСведений._ЗаказЗакупка.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.GUID.Установить(КлючУникальности);
			НаборЗаписей.Прочитать();
			Для Каждого ТекЗапись Из НаборЗаписей Цикл
				ТекЗапись.ОбработанЗаказ = ОбработанЗаказ;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;		// НЕ Выбран 		 
	ИначеЕсли ( ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаказПоставщику") ) ИЛИ ( ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказПоставщику") ) Тогда
		Если НЕ Объект._ДокЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка() Тогда
			ОбработкаРегистраПОзаказуПоствщика(Объект, Объект._ДокЗаявкаНаЗакупку, Удаление, ОбработанЗаказ);
		Иначе
			СписокЗаявокНаЗакупку = Объект.ПолучитьЗаявкиНаЗакупку();
			Если СписокЗаявокНаЗакупку.Количество() > 0 Тогда
				Для Каждого ТекЗаявка Из СписокЗаявокНаЗакупку Цикл
					ОбработкаРегистраПОзаказуПоствщика(Объект, ТекЗаявка, Удаление, ОбработанЗаказ);
				КонецЦикла;		// ТекЗаявка Из Список 
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры	//СформироватьЗаписиРегистра_ЗаказЗакупка(Объект)

&НаСервере
Процедура ОбработкаРегистраПОзаказуПоствщика(Объект ,ДокЗаявкаНаЗакупку, Удаление, ОбработанЗаказ)
			Если ЗначениеЗаполнено(ДокЗаявкаНаЗакупку.КлючУникальности) Тогда
				НаборЗаписей = РегистрыСведений._ЗаказЗакупка.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.GUID.Установить(ДокЗаявкаНаЗакупку.КлючУникальности);
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() > 1 Тогда
					НаборЗаписей = РегистрыСведений._ЗаказЗакупка.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.GUID.Установить(ДокЗаявкаНаЗакупку.КлючУникальности);
					НаборЗаписей.Отбор.ЗаказПоставщику.Установить(Объект.Ссылка);
					НаборЗаписей.Прочитать();
				КонецЕсли;
				Для Каждого ТекЗапись Из НаборЗаписей Цикл
					Если НЕ Удаление Тогда
						ТекЗапись.ЗаказПоставщику = Объект.Ссылка;
						ТекЗапись.ОбработанаЗаявка = ОбработанЗаказ
					Иначе
						ТекЗапись.ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
						ТекЗапись.ОбработанаЗаявка = ОбработанЗаказ
					КонецЕсли;
				КонецЦикла;
				НаборЗаписей.Записать();
			КонецЕсли;
	
КонецПроцедуры	// ОбработкаРегистраПОзаказуПоствщика()
 
&НаСервере
Функция ОтборЗаказовРегистр(Объект, КлючУникальности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		               |	_ЗаказЗакупка.ЗаказКлиента,
		               |	_ЗаказЗакупка.ЗаявкаНаЗакупку,
		               |	_ЗаказЗакупка.ЗаказПоставщику,
		               |	_ЗаказЗакупка.GUID,
		               |	_ЗаказЗакупка.ОбработанЗаказ,
		               |	_ЗаказЗакупка.ОбработанаЗаявка
		               |ИЗ
		               |	РегистрСведений._ЗаказЗакупка КАК _ЗаказЗакупка
		               |ГДЕ
		               |	_ЗаказЗакупка.ЗаявкаНаЗакупку = &ЗаявкаНаЗакупку
		               |	И _ЗаказЗакупка.GUID = &КлючУникальности";
	
	Запрос.УстановитьПараметр("ЗаявкаНаЗакупку", Объект.Ссылка);
	Запрос.УстановитьПараметр("КлючУникальности", КлючУникальности);
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции // ОтборЗаказовРегистр()

&НаСервере
// Получает таблицу остатков к заказу с учетом введенных на основании документов и состояния обеспечения потребности.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка.ЗаказКлиента, ДокументСсылка.ЗаказНаПроизводство, ДокументСсылка.ЗаказНаПеремещение,
//		ДокументСсылка.ЗаказНаВнутреннееПотребление, ДокументСсылка.ЗаказНаРемонт, ДокументСсылка.ЗаказНаСборкуРазборку,
//		ДокументСсылка.ВозвратТоваровОтКлиента - документ-основание
//	ПолучатьТовары - Булево - признак получения товаров
//	ПолучатьУслуги - Булево - признак получения услуг
//	ПолучатьРаботы - Булево - признак получения работ
//	Отбор		   - Произвольный - отбор, реализованный в методе ВременныеТаблицыТоваровЗаказа конкретного документа
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица остатков
//
Функция ТаблицаОстатковКЗаказу(ДокументСсылка, ПолучатьТовары = Истина, ПолучатьУслуги = Истина, ПолучатьРаботы = Истина, Отбор = Неопределено) Экспорт
	
	ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	
	//МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	УстановитьПривилегированныйРежим(Истина);
	
	//Если ЗначениеЗаполнено(Отбор) Тогда
	//	Документы[ИмяДокумента].ВременныеТаблицыТоваровЗаказа(МенеджерВременныхТаблиц, ДокументСсылка, Отбор);
	//Иначе
	//	Документы[ИмяДокумента].ВременныеТаблицыТоваровЗаказа(МенеджерВременныхТаблиц, ДокументСсылка);
	//КонецЕсли;
	
	ВариантОбеспечения = Новый СписокЗначений;
	
	ВариантОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.НеТребуется);
	ВариантОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.КОбеспечению);
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	              |	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	              |	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	              |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	              |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	              |	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	              |	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	              |	ЗаказКлиентаТовары.Количество КАК Количество,
	              |	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
	              |	ЗаказКлиентаТовары.Цена КАК Цена,
	              |	ЗаказКлиентаТовары.Сумма КАК Сумма,
	              |	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	              |	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	              |	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	              |	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	              |	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	              |	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	              |	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	              |	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
	              |	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
	              |	ЗаказКлиентаТовары.Отменено КАК Отменено,
	              |	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
	              |	ЗаказКлиентаТовары.Склад КАК Склад,
	              |	ЗаказКлиентаТовары.СрокПоставки КАК СрокПоставки,
	              |	ЗаказКлиентаТовары.Содержание КАК Содержание,
	              |	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	              |	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	              |	ЗаказКлиентаТовары.Серия КАК Серия,
	              |	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
	              |	ЗаказКлиентаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
				  //|	ЗаказКлиентаТовары.НаименованиеДляПечати КАК НаименованиеДляПечати,
	              |	ЗаказКлиентаТовары._УИДЗаказ КАК _УИДЗаказ,
	              |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК _НоменклатураКомплект,
	              |	0 КАК _КоличествоУпаковокКомплекта
	              |ИЗ
	              |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	              |ГДЕ
	              |	ЗаказКлиентаТовары.Ссылка = &ДокументСсылка
	              |	И ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	              |	И ЗаказКлиентаТовары.ВариантОбеспечения В(&ВариантОбеспечения)
	              |	И ЗаказКлиентаТовары._ЗаявкаНаЗакупку = &_ЗаявкаНаЗакупку";
				  
		
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВариантОбеспечения", ВариантОбеспечения);
	Запрос.УстановитьПараметр("_ЗаявкаНаЗакупку", Документы.ЗаявкаНаЗакупку.ПустаяСсылка());
	
	ТаблицаПромежуточная = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров		 = ТаблицаПромежуточная.Скопировать(); 
	ТаблицаТоваров.Очистить();
	
	Для Каждого ТекСтрока Из ТаблицаПромежуточная Цикл
		Если НЕ ТекСтрока.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		Иначе
			ТЗКомплекта = ПолучитьНоборКомплекта(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
			Если ТЗКомплекта.Количество() > 0 Тогда
				
				ДоляСтоимости = ТЗКомплекта.Итог("ДоляСтоимости");
				Если ДоляСтоимости = 0 Тогда
					ДоляСтоимости = 1;
				КонецЕсли;
				Для Каждого СтрКомплекта Из ТЗКомплекта Цикл
					НоваяСтрока = ТаблицаТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока, ,"КодСтроки, Номенклатура, Количество, КоличествоУпаковок, Упаковка, Цена, Сумма, СуммаНДС, СуммаРучнойСкидки, СуммаСНДС" );
					НоваяСтрока.Номенклатура					= СтрКомплекта.Номенклатура;
					НоваяСтрока.Количество						= СтрКомплекта.Количество * ТекСтрока.Количество;
					НоваяСтрока.КоличествоУпаковок				= СтрКомплекта.КоличествоУпаковок * ТекСтрока.КоличествоУпаковок;
					НоваяСтрока.Упаковка						= СтрКомплекта.Упаковка;
					НоваяСтрока.Цена							= ТекСтрока.Цена / ДоляСтоимости * СтрКомплекта.ДоляСтоимости;
					НоваяСтрока._НоменклатураКомплект			= ТекСтрока.Номенклатура;
					НоваяСтрока._КоличествоУпаковокКомплекта	= ТекСтрока.КоличествоУпаковок;
					
					СтруктураДействий = Новый Структура;
					ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ДокументСсылка.ПолучитьОбъект());	
					
					ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока,		СтруктураДействий);
					ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);
					ПересчитатьСуммуСНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);
					
				КонецЦикла;		// СтпКомплекта Из ТЗКомплекта
				
			Иначе			//ТЗКомплекта.Количество() > 0
				
				НоваяСтрока = ТаблицаТоваров.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				
			КонецЕсли;		//ТЗКомплекта.Количество() > 0
		КонецЕсли;		// НЕ ТекСтрока.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты"
	КонецЦикла;		// ТекСтрока ИзТаблицаПромежуточная 
	
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ТаблицаОстатковВнутрЗаказаКЗаказу(ДокументСсылка, ПолучатьТовары = Истина, ПолучатьУслуги = Истина, ПолучатьРаботы = Истина, Отбор = Неопределено) Экспорт
	
	ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	
	//МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	УстановитьПривилегированныйРежим(Истина);
	
	//Если ЗначениеЗаполнено(Отбор) Тогда
	//	Документы[ИмяДокумента].ВременныеТаблицыТоваровЗаказа(МенеджерВременныхТаблиц, ДокументСсылка, Отбор);
	//Иначе
	//	Документы[ИмяДокумента].ВременныеТаблицыТоваровЗаказа(МенеджерВременныхТаблиц, ДокументСсылка);
	//КонецЕсли;
	
	ВариантОбеспечения = Новый СписокЗначений;
	
	ВариантОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.НеТребуется);
	ВариантОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.КОбеспечению);
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	              |	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	              |	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	              |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	              |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	              |	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	              |	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	              |	ЗаказКлиентаТовары.Количество КАК Количество,
	              |	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
	              |	ЗаказКлиентаТовары.Отменено КАК Отменено,
	              |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	              |	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	              |	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	              |	ЗаказКлиентаТовары.Серия КАК Серия
	              |ИЗ
	              |	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ЗаказКлиентаТовары
	              |ГДЕ
	              |	ЗаказКлиентаТовары.Ссылка = &ДокументСсылка
	              |	И ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	              |	И ЗаказКлиентаТовары.ВариантОбеспечения В(&ВариантОбеспечения)
	              |	И ЗаказКлиентаТовары._ЗаявкаНаЗакупку = &_ЗаявкаНаЗакупку";
				  
		
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВариантОбеспечения", ВариантОбеспечения);
	Запрос.УстановитьПараметр("_ЗаявкаНаЗакупку", Документы.ЗаявкаНаЗакупку.ПустаяСсылка());
	
	ТаблицаПромежуточная = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров		 = ТаблицаПромежуточная.Скопировать(); 
	ТаблицаТоваров.Очистить();
	
	Для Каждого ТекСтрока Из ТаблицаПромежуточная Цикл
		Если НЕ ТекСтрока.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		Иначе
			ТЗКомплекта = ПолучитьНоборКомплекта(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
			Если ТЗКомплекта.Количество() > 0 Тогда
				
				ДоляСтоимости = ТЗКомплекта.Итог("ДоляСтоимости");
				Если ДоляСтоимости = 0 Тогда
					ДоляСтоимости = 1;
				КонецЕсли;
				Для Каждого СтрКомплекта Из ТЗКомплекта Цикл
					НоваяСтрока = ТаблицаТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока, ,"КодСтроки, Номенклатура, Количество, КоличествоУпаковок, Упаковка" );
					//НоваяСтрока.Номенклатура					= СтрКомплекта.Номенклатура;
					//НоваяСтрока.Количество						= СтрКомплекта.Количество * ТекСтрока.Количество;
					//НоваяСтрока.КоличествоУпаковок				= СтрКомплекта.КоличествоУпаковок * ТекСтрока.КоличествоУпаковок;
					//НоваяСтрока.Упаковка						= СтрКомплекта.Упаковка;
					//НоваяСтрока.Цена							= ТекСтрока.Цена / ДоляСтоимости * СтрКомплекта.ДоляСтоимости;
					//НоваяСтрока._НоменклатураКомплект			= ТекСтрока.Номенклатура;
					//НоваяСтрока._КоличествоУпаковокКомплекта	= ТекСтрока.КоличествоУпаковок;
					
					СтруктураДействий = Новый Структура;
					ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ДокументСсылка.ПолучитьОбъект());	
					
					//ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока,		СтруктураДействий);
					//ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);
					//ПересчитатьСуммуСНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);
					
				КонецЦикла;		// СтпКомплекта Из ТЗКомплекта
				
			Иначе			//ТЗКомплекта.Количество() > 0
				
				НоваяСтрока = ТаблицаТоваров.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				
			КонецЕсли;		//ТЗКомплекта.Количество() > 0
		КонецЕсли;		// НЕ ТекСтрока.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты"
	КонецЦикла;		// ТекСтрока ИзТаблицаПромежуточная 
	
	
	Возврат ТаблицаТоваров;
	
КонецФункции


&НаСервере
Функция ПолучитьНоборКомплекта(текНоменклатура, текХарактеристика) Экспорт
	
	ТЗКомплекта = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	               |	ВариантыКомплектацииНоменклатуры.Владелец КАК Владелец
	               |ИЗ
	               |	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	               |ГДЕ
	               |	ВариантыКомплектацииНоменклатуры.Владелец = &текНоменклатура
	               |	И ВариантыКомплектацииНоменклатуры.Характеристика = &текХарактеристика
	               |	И ВариантыКомплектацииНоменклатуры.Основной";
	
	Запрос.УстановитьПараметр("текНоменклатура",   текНоменклатура);
	Запрос.УстановитьПараметр("текХарактеристика", текХарактеристика);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТЗКомплекта = Выборка.Ссылка.Товары.Выгрузить();
	КонецЦикла;
	
	Возврат ТЗКомплекта;
	
КонецФункции // ПолучитьНоборКомплекта()


&НаСервере
Процедура ОбработкаЗаявкиНаЗакупкуПриПроведенииЗаказаПоставщику(ЗаказПоставщику, Отказ, ОтменаПроведения = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаЗаказаПоставщику Из ЗаказПоставщику.Товары Цикл
		УИДЗакупка = СтрокаЗаказаПоставщику._УИДЗакупка;
		Если НЕ ОтменаПроведения Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаЗаказаПоставщику._УИДЗакупка) Тогда
				СтруктураПоискаКонтроль = Новый Структура("Номенклатура, Характеристика, Заказано, ЗаказПоставщику", СтрокаЗаказаПоставщику.Номенклатура, СтрокаЗаказаПоставщику.Характеристика, Истина, ЗаказПоставщику.Ссылка);
				СтруктураПоиска			= Новый Структура("Номенклатура, Характеристика, Заказано", СтрокаЗаказаПоставщику.Номенклатура, СтрокаЗаказаПоставщику.Характеристика, Ложь);
			Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
				СтруктураПоискаКонтроль = Новый Структура("_УИДЗакупка, Заказано", СтрокаЗаказаПоставщику._УИДЗакупка, Истина);
				СтруктураПоиска			= Новый Структура("_УИДЗакупка, Заказано", СтрокаЗаказаПоставщику._УИДЗакупка, Ложь);
			КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
			
			ЗаказаноКол 			= СтрокаЗаказаПоставщику.КоличествоУпаковок;
			
			Если НЕ СтрокаЗаказаПоставщику._ЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка() Тогда
				
				ЗаявкаСсылка		= СтрокаЗаказаПоставщику._ЗаявкаНаЗакупку;
				ЗаявкаОбъект		= ЗаявкаСсылка.ПолучитьОбъект();
				ТоварыЗаявки		= ЗаявкаОбъект.Товары;
				СтрокиЗаявки		= ТоварыЗаявки.НайтиСтроки(СтруктураПоискаКонтроль);
				
				СтруктураДействий = Новый Структура;
				ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЗаявкаОбъект);	
				
				Если НЕ СтрокиЗаявки.Количество() = 0 Тогда
					Для Каждого СтрокаЗаявки Из СтрокиЗаявки Цикл
						ТекСтрокаЗаявки		= ТоварыЗаявки[СтрокаЗаявки.НомерСтроки - 1];
						КоличествоПоСтроке	= ТекСтрокаЗаявки.КоличествоУпаковок;
						ОстатокПоЗаказу		= КоличествоПоСтроке - ЗаказаноКол;
						
						Если НЕ ОстатокПоЗаказу = 0 Тогда
							
							Если ОстатокПоЗаказу < 0 Тогда
								
								СвободноеКоличество = 0;
								СвободныеСтроки = ТоварыЗаявки.НайтиСтроки(СтруктураПоиска);
								Если НЕ СвободныеСтроки.Количество() = 0 Тогда
									Для Каждого тСтр Из СвободныеСтроки Цикл
										СвободноеКоличество = СвободноеКоличество + тСтр.КоличествоУпаковок;
									КонецЦикла;
									
									Если -1 * ОстатокПоЗаказу > СвободноеКоличество Тогда
										Отказ = Истина;
									Иначе
										ТекСтрокаЗаявки.Количество					= ЗаказаноКол;
										ТекСтрокаЗаявки.КоличествоУпаковок			= ЗаказаноКол;
										ТекСтрокаЗаявки.ЗаказаноКоличество			= ЗаказаноКол;
										ТекСтрокаЗаявки.ЗаказаноКоличествоУпаковок	= ЗаказаноКол;
										
										СтрокиЗаявкиНеЗаказанные					= ТоварыЗаявки.НайтиСтроки(СтруктураПоиска);
										Если НЕ СтрокиЗаявкиНеЗаказанные.Количество() = 0 Тогда
											
											СтрокаЗаявкиНеЗаказанная			   				= СтрокиЗаявкиНеЗаказанные[0];
											СтрокаЗаявкиНеЗаказанная.Количество					= СтрокаЗаявкиНеЗаказанная.Количество + ОстатокПоЗаказу; 
											СтрокаЗаявкиНеЗаказанная.КоличествоУпаковок         = СтрокаЗаявкиНеЗаказанная.КоличествоУпаковок + ОстатокПоЗаказу;
											СтрокаЗаявкиНеЗаказанная.ЗаказаноКоличество         = 0;
											СтрокаЗаявкиНеЗаказанная.ЗаказаноКоличествоУпаковок = 0;
											СтрокаЗаявкиНеЗаказанная.ЗаказПоставщику            = Документы.ЗаказПоставщику.ПустаяСсылка();
											
										КонецЕсли;
										
									КонецЕсли;	// ОстатокПоЗаказу > СвободноеКоличество
									
								Иначе
									Отказ = Истина;
								КонецЕсли;		// СвободныеСтроки.Количество() = 0 		 
								
								Если Отказ Тогда
									ТекстСообщения  = НСтр("ru='Вы не можете заказать больше чем в Заявке на заказ - '") + Строка(ТекСтрокаЗаявки.КоличествоУпаковок + СвободноеКоличество) +
													  НСтр("ru='  Заказываете - '") + СтрокаЗаказаПоставщику.КоличествоУпаковок;
									ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
									Отказ = Истина;
									Возврат;
								КонецЕсли;
								
							Иначе		// ОстатокПоЗаказу < 0	
								
								ТекСтрокаЗаявки.Количество					= ЗаказаноКол;
								ТекСтрокаЗаявки.КоличествоУпаковок			= ЗаказаноКол;
								ТекСтрокаЗаявки.ЗаказаноКоличество			= ЗаказаноКол;
								ТекСтрокаЗаявки.ЗаказаноКоличествоУпаковок	= ЗаказаноКол;
								
								СтрокиЗаявкиНеЗаказанные					= ТоварыЗаявки.НайтиСтроки(СтруктураПоиска);
								Если НЕ СтрокиЗаявкиНеЗаказанные.Количество() = 0 Тогда
									
									СтрокаЗаявкиНеЗаказанная			   				= СтрокиЗаявкиНеЗаказанные[0];
									СтрокаЗаявкиНеЗаказанная.Количество					= СтрокаЗаявкиНеЗаказанная.Количество + ОстатокПоЗаказу; 
									СтрокаЗаявкиНеЗаказанная.КоличествоУпаковок         = СтрокаЗаявкиНеЗаказанная.КоличествоУпаковок + ОстатокПоЗаказу;
									СтрокаЗаявкиНеЗаказанная.ЗаказаноКоличество         = 0;
									СтрокаЗаявкиНеЗаказанная.ЗаказаноКоличествоУпаковок = 0;
									СтрокаЗаявкиНеЗаказанная.ЗаказПоставщику            = Документы.ЗаказПоставщику.ПустаяСсылка();
									
								Иначе
									РазбитьСтрокуТЧЗаявки(ЗаявкаОбъект.Товары, ТекСтрокаЗаявки, ЗаказаноКол, ОстатокПоЗаказу, ЗаказПоставщику.Ссылка, СтруктураДействий, ,УИДЗакупка);
								КонецЕсли;
							
							КонецЕсли;	// ОстатокПоЗаказу < 0 
							
						КонецЕсли;		// НЕ ОстатокПоЗаказу = 0
						
					КонецЦикла;		// СтрокаЗаявки Из СтрокиЗаявки
				Иначе		//НЕ СтрокаЗаявки.Количество() = 0
					
					СтрокиЗаявки	= ТоварыЗаявки.НайтиСтроки(СтруктураПоиска);
					
					Если НЕ СтрокиЗаявки.Количество() = 0 Тогда
						
						Для Каждого СтрокаЗаявки Из СтрокиЗаявки Цикл
							ТекСтрокаЗаявки	= ТоварыЗаявки[СтрокаЗаявки.НомерСтроки - 1];
							ОстатокПоЗаказу = ТекСтрокаЗаявки.КоличествоУпаковок - ЗаказаноКол;
							
							Если ОстатокПоЗаказу = 0 Тогда
								
								ТекСтрокаЗаявки.Заказано					= Истина;
								ТекСтрокаЗаявки.ЗаказаноКоличество			= ЗаказаноКол;
								ТекСтрокаЗаявки.ЗаказаноКоличествоУпаковок	= ЗаказаноКол;
								ТекСтрокаЗаявки.ЗаказПоставщику				= ЗаказПоставщику.Ссылка;
								
							ИначеЕсли ОстатокПоЗаказу > 0 Тогда
								
								РазбитьСтрокуТЧЗаявки(ЗаявкаОбъект.Товары, ТекСтрокаЗаявки, ЗаказаноКол, ОстатокПоЗаказу, ЗаказПоставщику.Ссылка, СтруктураДействий, ,УИДЗакупка);
								
							ИначеЕсли ОстатокПоЗаказу < 0 Тогда
								
								ТекстСообщения = НСтр("ru='Вы не можете заказать больше чем в Заявке на заказ - '") + ТекСтрокаЗаявки.КоличествоУпаковок + 
												 НСтр("ru='  Заказываете - '") + СтрокаЗаказаПоставщику.КоличествоУпаковок;
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
								Отказ = Истина;
								Возврат;
								
							КонецЕсли	//ОстатокПоЗаказу
							
						КонецЦикла;	// СтрокаЗаявки Из СтрокиЗаявки
						
					КонецЕсли;	//НЕ СтрокиЗаявки.Количество() = 0
					
				КонецЕсли;	// НЕ СтрокаЗаявки.Количество() = 0
				
			КонецЕсли;	// НЕ СтрокаЗаказаПоставщику._ЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка()
			
		Иначе			// НЕ ОтменаПроведения
			
			Если НЕ ЗначениеЗаполнено(СтрокаЗаказаПоставщику._УИДЗакупка) Тогда
				СтруктураПоиска			= Новый Структура("Номенклатура, Характеристика, Заказано, ЗаказПоставщику", СтрокаЗаказаПоставщику.Номенклатура, СтрокаЗаказаПоставщику.Характеристика, Истина, ЗаказПоставщику.Ссылка);
				СтруктураПоискаКонтроль	= Новый Структура("Номенклатура, Характеристика, Заказано", СтрокаЗаказаПоставщику.Номенклатура, СтрокаЗаказаПоставщику.Характеристика, Ложь);
			Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
				СтруктураПоиска			= Новый Структура("_УИДЗакупка, Заказано", СтрокаЗаказаПоставщику._УИДЗакупка, Истина);
				СтруктураПоискаКонтроль	= Новый Структура("_УИДЗакупка, Заказано", СтрокаЗаказаПоставщику._УИДЗакупка, Ложь);
			КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
			
			Если НЕ СтрокаЗаказаПоставщику._ЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка() Тогда
				
				ЗаявкаСсылка		= СтрокаЗаказаПоставщику._ЗаявкаНаЗакупку;
				ЗаявкаОбъект		= ЗаявкаСсылка.ПолучитьОбъект();
				ТоварыЗаявки		= ЗаявкаОбъект.Товары;
				СтрокиЗаявки		= ТоварыЗаявки.НайтиСтроки(СтруктураПоиска);
				
				СтруктураДействий = Новый Структура;
				ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЗаявкаОбъект);	
				
				Если НЕ СтрокиЗаявки.Количество() = 0 Тогда
					
					Для Каждого ТекСтрокаЗаявки Из СтрокиЗаявки Цикл
						ТекСтрокаЗаявки.Заказано				   = Ложь;
						ТекСтрокаЗаявки.ЗаказаноКоличество		   = 0;
						ТекСтрокаЗаявки.ЗаказаноКоличествоУпаковок = 0;
						ТекСтрокаЗаявки.ЗаказПоставщику			   = Документы.ЗаказПоставщику.ПустаяСсылка();
					КонецЦикла;		// ТекСтрокаЗаявки Из СтрокиЗаявки 
					
				КонецЕсли;
				
				ОбъеденитьстрокиТЧЗаявки(ТоварыЗаявки, СтруктураПоискаКонтроль, СтруктураДействий);
				
			КонецЕсли;		// НЕ СтрокаЗаказаПоставщику._ЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка() 		
			
		КонецЕсли;		// НЕ ОтменаПроведения  
		
		Если НЕ ЗаявкаОбъект = Неопределено Тогда
			ЗаявкаОбъект.ОбработкаЗаказаПоставщика	= Истина;
			ОбработкаПустыхСтрокТЧ(ЗаявкаОбъект.Товары , Новый Структура("Номенклатура, Характеристика, КоличествоУпаковок", СтрокаЗаказаПоставщику.Номенклатура, СтрокаЗаказаПоставщику.Характеристика, 0));
			_ДоработкиСлужебный.ЗаписатьДокументКлиента(ЗаявкаОбъект);
		КонецЕсли;
		
	КонецЦикла;	// СтрокаЗаказаПоставщику Из ЗаказПоставщику.Товары
	
КонецПроцедуры	// ОбработкаЗаявкиНазакупкуПриПроведенииЗаказаПоставщику(Ссылка)

&НаСервере
Процедура ОбработкаЗаявкиНазакупкуПриОтменеПроведенииЗаказаПоставщику(Объект, КлючУникальности, Удаление = Ложь) Экспорт
	
КонецПроцедуры	// ОбработкаЗаявкиНазакупкуПриОтменеПроведенииЗаказаПоставщику()

&НаСервере
Функция ПолучитьЗаявкуНаЗакупку(ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаЗакупку.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	|ГДЕ
	|	ЗаявкаНаЗакупку.Проведен = ИСТИНА
	|	И ЗаявкаНаЗакупку.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ЗаявкаНаЗакупку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
	|	И ЗаявкаНаЗакупку.ДокументОснование = &ДокументОснование
	|";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказКлиента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Возврат Выборка;
	
КонецФункции // ПолучитьЗаявкуНаЗакупку(СтрокаЗаказаПоставщику)

&НаСервере
Функция ПолучитьСтрокуТовара(ЗаявкаЗакупки, СтруктураПоиска)
	
	Номенклатура   = СтруктураПоиска.Номенклатура;
	Характеристика = СтруктураПоиска.Характеристика;
	Заказано	   = СтруктураПоиска.Заказано;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	Товары.Ссылка КАК Ссылка,
					|	Товары.НомерСтроки КАК НомерСтроки,
					|	Товары.Номенклатура КАК Номенклатура,
					|	Товары.Характеристика КАК Характеристика,
					|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
					|	Товары.Количество КАК Количество,
					|	Товары.Заказано КАК Заказано
					|ИЗ
					|	Документ.ЗаявкаНаЗакупку.Товары КАК Товары
					|ГДЕ
					|	Товары.Ссылка = &ЗаявкаЗакупки
					|	И Товары.Номенклатура = &Номенклатура
					|	И Товары.Характеристика = &Характеристика
					|	И Товары.Заказано = &Заказано
					|";
	Запрос.УстановитьПараметр("ЗаявкаЗакупки", 	ЗаявкаЗакупки);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Заказано", Заказано);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат[0].НомерСтроки;
	
КонецФункции // ПолучитьСтрокуТовара()

&НаСервере
Процедура РазбитьСтрокуТЧЗаявки(ТЧ, ТекущаяСтрока, ЗаказаноКол, Остаток, ЗаказПоставщику, СтруктураДействий, УИДЗаказ = Неопределено, УИДЗакупка = Неопределено, Заказано = Истина)
	
	Если УИДЗаказ = Неопределено Тогда
		УИДЗаказ							= Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	Если УИДЗакупка = Неопределено Тогда
		УИДЗакупка							= Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УИДЗакупка) Тогда
		СруктураПоиска						= Новый Структура("_УИДЗакупка", УИДЗакупка);
		НайденныеСтроки						= ТЧ.НайтиСтроки(Новый Структура("_УИДЗакупка", УИДЗакупка));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока					= НайденныеСтроки[0];
		КонецЕсли;
	КонецЕсли;		// НЕ ЗначениеЗаполнено(УИДЗакупка) 
		
	Если ТипЗнч(ТекущаяСтрока) = Тип("ДокументТабличнаяЧастьСтрока.ЗаявкаНаЗакупку.Товары") Тогда
		ИндексТекущейСтроки 	 			= ТЧ.Индекс(ТекущаяСтрока);
		Если Заказано Тогда
			НоваяСтрока			 			= ТЧ.Добавить();
		Иначе
			НоваяСтрока			 			= ТЧ.Вставить(ИндексТекущейСтроки + 1);
		КонецЕсли;
		ЗаказаноКоличествоУпаковок			= ЗаказаноКол;
		ЗаказаноКоличество					= ЗаказаноКол;
	ИначеЕсли ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
		ИндексТекущейСтроки					= ТекущаяСтрока;
		ТекущаяСтрока						= ТЧ[ИндексТекущейСтроки];
		НоваяСтрока 			 			= ТЧ.Вставить(ИндексТекущейСтроки + 1);
		ЗаказаноКоличествоУпаковок			= 0;
		ЗаказаноКоличество					= 0;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока, ,"_УИДЗакупка");
	
	ТекущаяСтрока.КоличествоУпаковок		 = ЗаказаноКол;
	ТекущаяСтрока.ЗаказаноКоличествоУпаковок = ЗаказаноКоличествоУпаковок; 
	ТекущаяСтрока.Количество				 = ЗаказаноКол;
	ТекущаяСтрока.ЗаказаноКоличество		 = ЗаказаноКоличество; 
	ТекущаяСтрока.Заказано					 = Заказано; 
	ТекущаяСтрока.ЗаказПоставщику			 = ЗаказПоставщику;
	ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока,	СтруктураДействий);
	ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока,	СтруктураДействий);
	ПересчитатьСуммуСНДСВСтрокеТЧ(ТекущаяСтрока,СтруктураДействий);
	
	НоваяСтрока.КоличествоУпаковок			 = Остаток;
	НоваяСтрока.ЗаказаноКоличествоУпаковок	 = 0; 
	НоваяСтрока.Количество					 = Остаток;
	НоваяСтрока.ЗаказаноКоличество			 = 0; 
	НоваяСтрока.Заказано					 = Ложь; 
	НоваяСтрока.ЗаказПоставщику				 = Документы.ЗаказПоставщику.ПустаяСсылка();
	НоваяСтрока._УИДЗакупка					 = Новый УникальныйИдентификатор();
	ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока,		СтруктураДействий);
	ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);
	ПересчитатьСуммуСНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);

	Если ТекущаяСтрока.Упаковка.Числитель	 = 0 Тогда
		Числитель = 1;
	Иначе
		Числитель = ТекущаяСтрока.Упаковка.Числитель;
	КонецЕсли;
	
КонецПроцедуры	// РазбитьСтрокуТЧЗаявки()

&НаСервере
Процедура ОбъеденитьстрокиТЧЗаявки(ТЧ, СтруктураДляПоиска, СтруктураДействий)
	СтрокиДляОбъединения = ТЧ.НайтиСтроки(СтруктураДляПоиска);
	ТЗДляОбъединения	 = ТЧ.Выгрузить();
	ТЗДляОбъединения.Очистить();
	Для Каждого СтрокаМассива Из СтрокиДляОбъединения Цикл
		НоваяСтрока = ТЗДляОбъединения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;		// СтрокаУдаления Из 
	КоличествоУпаковок	 = ТЗДляОбъединения.Итог("КоличествоУпаковок");
	Количество			 = ТЗДляОбъединения.Итог("Количество");
	СтрокаОбьединения	 = ТЧ[ТЗДляОбъединения[0].НомерСтроки - 1];
	
	ТЗДляОбъединения.Сортировать("НомерСтроки Убыв"); 
	Для Стр = 0 По ТЗДляОбъединения.Количество() - 2 Цикл
		НомерУдаляемойстроки = ТЗДляОбъединения[Стр].НомерСтроки - 1;
		ТЧ.Удалить(НомерУдаляемойстроки);
	КонецЦикла;		// Стр
	
	СтрокаОбьединения.КоличествоУпаковок = КоличествоУпаковок;
	СтрокаОбьединения.Количество		 = Количество;
	
	ПересчитатьСуммуВСтрокеТЧ(СтрокаОбьединения,	СтруктураДействий);
	ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаОбьединения,	СтруктураДействий);
	ПересчитатьСуммуСНДСВСтрокеТЧ(СтрокаОбьединения,СтруктураДействий);
	
КонецПроцедуры	// ОбъеденитьстрокиТЧЗаявки()

#КонецОбласти



#Область ОбработкаЗаказаКлиентаИзДокументаЗаявкаНаЗакупку

&НаСервере
Процедура ОбработкаСтатусаЗаказа(Заказ, Удаление)
	
		Состояние	 = ?(Удаление, Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяСогласование, Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОбеспечение);
		Статус		 = ?(Удаление, Перечисления.СтатусыЗаказовКлиентов.НеСогласован, Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);
		мЗапись		 = Ложь;
		
		Если НЕ Удаление Тогда
			Для Каждого ТекСтрока Из Заказ.Товары Цикл
				Если ТекСтрока._ЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка() Тогда
					Состояние = Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОбеспечение;
					Прервать;
				КонецЕсли;		// _ЗаявкаНаЗакупку 		
			КонецЦикла;		// ТекСтрока
		КонецЕсли;		// НЕ Удаление 		
		
		НаборЗаписей = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ.Ссылка);
		НаборЗаписей.Прочитать();
		Для Каждого ТекЗапись Из НаборЗаписей Цикл
			Если НЕ ТекЗапись.Состояние = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
				Если НЕ ТекЗапись.Состояние = Состояние Тогда
					мЗапись = Истина;
				КонецЕсли;		// НЕ ТекЗапись.Состояние = Статус 		 
				Заказ.Статус = Статус;
				
				ДатаСобытия								= ТекЗапись.ДатаСобытия;
				СуммаОплаты								= ТекЗапись.СуммаОплаты;
				ПроцентОплаты							= ТекЗапись.ПроцентОплаты;
				СуммаОтгрузки							= ТекЗапись.СуммаОтгрузки;
				ПроцентОтгрузки							= ТекЗапись.ПроцентОтгрузки;
				СуммаДолга								= ТекЗапись.СуммаДолга;
				ПроцентДолга							= ТекЗапись.ПроцентДолга;
				ЕстьРасхожденияОрдерНакладная			= ТекЗапись.ЕстьРасхожденияОрдерНакладная;
				
				ТекЗапись.Состояние						= Состояние;
	  			ТекЗапись.ДатаСобытия					= ?(ДатаСобытия = Дата(1, 1, 1), Заказ.Дата, ДатаСобытия);
				ТекЗапись.СуммаОплаты					= СуммаОплаты;
				ТекЗапись.ПроцентОплаты					= ПроцентОплаты;
				ТекЗапись.СуммаОтгрузки					= СуммаОтгрузки;
				ТекЗапись.ПроцентОтгрузки				= ПроцентОтгрузки;
				ТекЗапись.СуммаДолга					= СуммаДолга;
				ТекЗапись.ПроцентДолга					= ПроцентДолга;
				ТекЗапись.ЕстьРасхожденияОрдерНакладная = ЕстьРасхожденияОрдерНакладная;
				
			КонецЕсли;		// НЕ ТекЗапись.Состояние = Перечисления.СтатусыЗаказовКлиентов.Закрыт 		
		КонецЦикла;
		Если мЗапись Тогда
			НаборЗаписей.Записать(); 
		КонецЕсли;		// мЗапись 		
	
КонецПроцедуры	// ОбработкаСтатусаЗаказа()
 
&НаСервере
Процедура РазбитьСтрокуТЧЗаказа(ТЧ, ТекущаяСтрока, КолНаЗакупку, ПараметрыОбработки, СтруктураДействий)
	
	ИндексТекущейСтроки 	 = ТЧ.Индекс(ТекущаяСтрока);
	НоваяСтрока 			 = ТЧ.Добавить();
	//	НоваяСтрока 			 = ТЧ.Вставить(ИндексТекущейСтроки + 1);
	Остаток					 = ТекущаяСтрока[ПараметрыОбработки.ИмяПоляКоличество] - КолНаЗакупку;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока, ,"_УИДЗаказ");
	НоваяСтрока._УИДЗаказ	 = Новый УникальныйИдентификатор();
	
	ТекущаяСтрока[ПараметрыОбработки.ИмяПоляКоличество]		= КолНаЗакупку;
	НоваяСтрока[ПараметрыОбработки.ИмяПоляКоличество]		= Остаток;
	
	Если ТекущаяСтрока.Упаковка.Числитель = 0 Тогда
		Числитель = 1;
	Иначе
		Числитель = ТекущаяСтрока.Упаковка.Числитель;
	КонецЕсли;
	
	
	//**Изменено 25.09.19 Максимов 
	НоваяСтрока[ПараметрыОбработки.ИмяКоличествоУпаковок]	= Остаток / Числитель;
	НоваяСтрока.ВариантОбеспечения							=  Перечисления.ВариантыОбеспечения.НеТребуется;
	ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока,		СтруктураДействий);
	ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);
	ПересчитатьСуммуСНДСВСтрокеТЧ(НоваяСтрока,	СтруктураДействий);
	
	ТекущаяСтрока[ПараметрыОбработки.ИмяКоличествоУпаковок]	= КолНаЗакупку / Числитель;
	ТекущаяСтрока.ВариантОбеспечения						= Перечисления.ВариантыОбеспечения.КОбеспечению;			//Требуется;
	ТекущаяСтрока.Обособленно								= Истина;
	ТекущаяСтрока._УИДОтгрузка								= Новый УникальныйИдентификатор();
	ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока,	СтруктураДействий);
	ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока,	СтруктураДействий);
	ПересчитатьСуммуСНДСВСтрокеТЧ(ТекущаяСтрока,СтруктураДействий);

	
КонецПроцедуры	// РазбитьСтрокуТЧЗаказа()

&НаСервере
Процедура ОбъеденитьстрокиТЧЗаказа(ТЧ, ПараметрыОбработки, СтруктураДействий, СтруктураДляПоиска)
	СтрокиДляОбъединения = ТЧ.НайтиСтроки(СтруктураДляПоиска);
	ТЗДляОбъединения	 = ТЧ.Выгрузить();
	ТЗДляОбъединения.Очистить();
	Для Каждого СтрокаМассива Из СтрокиДляОбъединения Цикл
		НоваяСтрока = ТЗДляОбъединения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;		// СтрокаУдаления Из 
	КоличествоУпаковок	 = ТЗДляОбъединения.Итог("КоличествоУпаковок");
	Количество			 = ТЗДляОбъединения.Итог("Количество");
	СтрокаОбьединения	 = ТЧ[ТЗДляОбъединения[0].НомерСтроки - 1];
	
	ТЗДляОбъединения.Сортировать("НомерСтроки Убыв"); 
	Для Стр = 0 По ТЗДляОбъединения.Количество() - 2 Цикл
		НомерУдаляемойстроки = ТЗДляОбъединения[Стр].НомерСтроки - 1;
		ТЧ.Удалить(НомерУдаляемойстроки);
	КонецЦикла;		// Стр
	
	СтрокаОбьединения.КоличествоУпаковок = КоличествоУпаковок;
	СтрокаОбьединения.Количество		 = Количество;

	СтрокаОбьединения.ВариантОбеспечения =  Перечисления.ВариантыОбеспечения.НеТребуется;
	ПересчитатьСуммуВСтрокеТЧ(СтрокаОбьединения,	СтруктураДействий);
	ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаОбьединения,	СтруктураДействий);
	ПересчитатьСуммуСНДСВСтрокеТЧ(СтрокаОбьединения,СтруктураДействий);
	
КонецПроцедуры	// ОбъеденитьстрокиТЧ()

&НаСервере
Процедура ОбработкаЗаказаКлиентаПоЗаявкеНаЗакупку(ЗаявкаНаЗакупку, КлючУникальности, Удаление = Ложь) Экспорт
	
	ТоварыНаЗакупку = ПолучитьТоваыЗаявкиНаЗакупку(ЗаявкаНаЗакупку).Выгрузить();
	Заказы			= ОтборЗаказовРегистр(ЗаявкаНаЗакупку, КлючУникальности).Выгрузить();
	Статус		 	= ?(Удаление, Перечисления.СтатусыЗаказовКлиентов.НеСогласован, Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);
	
	Для Каждого ТекЗаказ Из Заказы Цикл
		
		ОбъектЗаказ = ТекЗаказ.ЗаказКлиента.ПолучитьОбъект();
		
		Если ( ОбъектЗаказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Удаление  Тогда	
			Если ( ТекЗаказ.ОбработанЗаказ ) Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Если НЕ ( ТекЗаказ.ОбработанЗаказ ) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ОбъектЗаказ.Статус = Статус;
		
		СтруктураДействий = Новый Структура;
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ОбъектЗаказ);	
		
		ТекКомплект = Справочники.Номенклатура.ПустаяСсылка();
		//++ Ниронов 2025-09-24
		ТекУИДЗаказ = Неопределено;
		//-- Ниронов 2025-09-24
		
		Для Каждого ТекСтрока Из ТоварыНаЗакупку Цикл
			
			Если НЕ ТекСтрока._НоменклатураКомплект = Справочники.Номенклатура.ПустаяСсылка()
				И ТекСтрока._НоменклатураКомплект = ТекКомплект
				И ТекСтрока._УИДЗаказ = ТекУИДЗаказ Тогда //++ Ниронов 2025-09-24
				
				Продолжить;
			Иначе
				Если ТекСтрока._НоменклатураКомплект = Справочники.Номенклатура.ПустаяСсылка() Тогда
					тНоменклатура = ТекСтрока.Номенклатура;
					КолНаЗакупку  = ТекСтрока.Количество;
				Иначе
					ТекКомплект	  = ТекСтрока._НоменклатураКомплект;
					//++ Ниронов 2025-09-24
					ТекУИДЗаказ	  = ТекСтрока._УИДЗаказ;
					//-- Ниронов 2025-09-24
					тНоменклатура = ТекСтрока._НоменклатураКомплект;
					КолНаЗакупку  = ТекСтрока._КоличествоУпаковокКомплекта;
				КонецЕсли;
			КонецЕсли;
			
			Если Удаление Тогда
				Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДЗаказ) Тогда
					СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, ВариантОбеспечения, _ЗаявкаНаЗакупку", тНоменклатура, ТекСтрока.Характеристика, Перечисления.ВариантыОбеспечения.КОбеспечению, ЗаявкаНаЗакупку.Ссылка);
				Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
					//СтруктураДляПоиска = Новый Структура("ВариантОбеспечения, _УИДЗаказ", Перечисления.ВариантыОбеспечения.Обособленно, ТекСтрока._УИДЗаказ);
					СтруктураДляПоиска = Новый Структура("_УИДЗаказ", ТекСтрока._УИДЗаказ);
				КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
			Иначе
				Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДЗаказ) Тогда
					СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, ВариантОбеспечения ", тНоменклатура, ТекСтрока.Характеристика, Перечисления.ВариантыОбеспечения.НеТребуется);
				Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
					СтруктураДляПоиска = Новый Структура("ВариантОбеспечения, _УИДЗаказ", Перечисления.ВариантыОбеспечения.НеТребуется, ТекСтрока._УИДЗаказ);
					//СтруктураДляПоиска = Новый Структура("_УИДЗаказ", ТекСтрока._УИДЗаказ);
				КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
			КонецЕсли;  
			
			Если КолНаЗакупку = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТоварыЗаказа		= ОбъектЗаказ.Товары;
			СтрНоменклатуры		= ТоварыЗаказа.НайтиСтроки(СтруктураДляПоиска);
			ПараметрыОбработки	= _ДоработкиСлужебный.ПараметрыРазбиенияСтроки();
			
			Для Каждого Строка Из СтрНоменклатуры Цикл
				
				//ТЗКомплекта = ПолучитьНоборКомплекта(Строка.Номенклатура, Строка.Характеристика);
				//Если ТЗКомплекта.Количество() = 0 Тогда
					
					Если НЕ Удаление  Тогда	
						
						//**  
						//Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно  Тогда
						//	Продолжить;
						//КонецЕсли;
						
						ОстатокПоЗаказу = Строка.Количество - КолНаЗакупку;
						
						Если ОстатокПоЗаказу <= 0 Тогда
							Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда
								Строка.ВариантОбеспечения  = Перечисления.ВариантыОбеспечения.КОбеспечению; //Требуется;
								Строка.Обособленно         = Истина;
							КонецЕсли;
							Строка._ЗаявкаНаЗакупку = ЗаявкаНаЗакупку.Ссылка;
							Продолжить;
						КонецЕсли;
						
						РазбитьСтрокуТЧЗаказа(ТоварыЗаказа, Строка, КолНаЗакупку, ПараметрыОбработки, СтруктураДействий);
						ОстатокПоЗаказу = 0;
						Строка._ЗаявкаНаЗакупку = ЗаявкаНаЗакупку.Ссылка; 
						ОбработанЗаказ = Истина;
					Иначе		//НЕ Удаление
						Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;			//Обособленно
						Строка._ЗаявкаНаЗакупку   = Документы.ЗаявкаНаЗакупку.ПустаяСсылка();
						Строка._УИДОтгрузка		  = Новый УникальныйИдентификатор();
						ОстатокПоЗаказу			  = Строка.Количество;
						ОбработанЗаказ			  = Ложь;
					КонецЕсли;		// НЕ Удаление 		 
					
				//Иначе
				//	ОстатокПоЗаказу = 0;
				//КонецЕсли;		//ТЗКомплекта.Количество() = 0
				
			КонецЦикла;		//Строка
			
			Если Удаление Тогда
				Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДЗаказ) Тогда
				СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, ВариантОбеспечения, _ЗаявкаНаЗакупку", тНоменклатура, ТекСтрока.Характеристика, Перечисления.ВариантыОбеспечения.НеТребуется, Документы.ЗаявкаНаЗакупку.ПустаяСсылка());
				Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
					СтруктураДляПоиска = Новый Структура("ВариантОбеспечения, _УИДЗаказ", Перечисления.ВариантыОбеспечения.НеТребуется, ТекСтрока._УИДЗаказ);
				КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
				
				СтрНоменклатуры = ТоварыЗаказа.НайтиСтроки(СтруктураДляПоиска);
				Если СтрНоменклатуры.Количество() > 1 Тогда
					ОбъеденитьстрокиТЧЗаказа(ТоварыЗаказа, ПараметрыОбработки, СтруктураДействий, СтруктураДляПоиска);
				КонецЕсли;
			КонецЕсли; 
			
			ТекСтрока.Количество = ОстатокПоЗаказу;
			
			
		КонецЦикла;		// ТекСтрока
		
		Если ( НЕ Удаление ) И ( ОбработанЗаказ = НЕОПРЕДЕЛЕНО ) Тогда
			ОбработанЗаказ = Истина;
		КонецЕсли;
		
		СформироватьЗаписиРегистра_ЗаказЗакупка(ЗаявкаНаЗакупку, КлючУникальности, Удаление, Истина, ОбработанЗаказ);
		
		_ДоработкиСлужебный.ЗаписатьДокументКлиента(ОбъектЗаказ, Истина);
		
	КонецЦикла;		// ТекЗаказ		
	
КонецПроцедуры	//ОбработкаЗаказов()

&НаСервере
Процедура ОбработкаВнутреннегоЗаказаПоЗаявкеНаЗакупку(ЗаявкаНаЗакупку, КлючУникальности, Удаление = Ложь) Экспорт
	
	ТоварыНаЗакупку = ПолучитьТоваыЗаявкиНаЗакупку(ЗаявкаНаЗакупку).Выгрузить();
	Заказы			= ОтборЗаказовРегистр(ЗаявкаНаЗакупку, КлючУникальности).Выгрузить();
	Статус		 	= ?(Удаление, Перечисления.СтатусыВнутреннихЗаказов.Закрыт, Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
	
	Для Каждого ТекЗаказ Из Заказы Цикл
		
		ОбъектЗаказ = ТекЗаказ.ЗаказКлиента.ПолучитьОбъект();
		
		Если ( ОбъектЗаказ.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Удаление  Тогда	
			Если ( ТекЗаказ.ОбработанЗаказ ) Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Если НЕ ( ТекЗаказ.ОбработанЗаказ ) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ОбъектЗаказ.Статус = Статус;
		
		СтруктураДействий = Новый Структура;
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ОбъектЗаказ);	
		
		ТекКомплект = Справочники.Номенклатура.ПустаяСсылка();
		//++ Ниронов 2025-09-24
		ТекУИДЗаказ = Неопределено;
		//-- Ниронов 2025-09-24
		
		Для Каждого ТекСтрока Из ТоварыНаЗакупку Цикл
			
			Если НЕ ТекСтрока._НоменклатураКомплект = Справочники.Номенклатура.ПустаяСсылка()
				И ТекСтрока._НоменклатураКомплект = ТекКомплект
				И ТекСтрока._УИДЗаказ = ТекУИДЗаказ Тогда //++ Ниронов 2025-09-24
				
				Продолжить;
			Иначе
				Если ТекСтрока._НоменклатураКомплект = Справочники.Номенклатура.ПустаяСсылка() Тогда
					тНоменклатура = ТекСтрока.Номенклатура;
					КолНаЗакупку  = ТекСтрока.Количество;
				Иначе
					ТекКомплект	  = ТекСтрока._НоменклатураКомплект;
					//++ Ниронов 2025-09-24
					ТекУИДЗаказ	  = ТекСтрока._УИДЗаказ;
					//-- Ниронов 2025-09-24
					тНоменклатура = ТекСтрока._НоменклатураКомплект;
					КолНаЗакупку  = ТекСтрока._КоличествоУпаковокКомплекта;
				КонецЕсли;
			КонецЕсли;
			
			Если Удаление Тогда
				Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДЗаказ) Тогда
					СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, ВариантОбеспечения, _ЗаявкаНаЗакупку", тНоменклатура, ТекСтрока.Характеристика, Перечисления.ВариантыОбеспечения.КОбеспечению, ЗаявкаНаЗакупку.Ссылка);
				Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
					//СтруктураДляПоиска = Новый Структура("ВариантОбеспечения, _УИДЗаказ", Перечисления.ВариантыОбеспечения.Обособленно, ТекСтрока._УИДЗаказ);
					СтруктураДляПоиска = Новый Структура("_УИДЗаказ", ТекСтрока._УИДЗаказ);
				КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
			Иначе
				//Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДЗаказ) Тогда
					СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, ВариантОбеспечения ", тНоменклатура, ТекСтрока.Характеристика, Перечисления.ВариантыОбеспечения.НеТребуется);
				//Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
				//	СтруктураДляПоиска = Новый Структура("ВариантОбеспечения, _УИДЗаказ", Перечисления.ВариантыОбеспечения.НеТребуется, ТекСтрока._УИДЗаказ);
				//	//СтруктураДляПоиска = Новый Структура("_УИДЗаказ", ТекСтрока._УИДЗаказ);
				//КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
			КонецЕсли;  
			
			Если КолНаЗакупку = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТоварыЗаказа		= ОбъектЗаказ.Товары;
			СтрНоменклатуры		= ТоварыЗаказа.НайтиСтроки(СтруктураДляПоиска);
			ПараметрыОбработки	= _ДоработкиСлужебный.ПараметрыРазбиенияСтроки();
			
			Для Каждого Строка Из СтрНоменклатуры Цикл
				
				//ТЗКомплекта = ПолучитьНоборКомплекта(Строка.Номенклатура, Строка.Характеристика);
				//Если ТЗКомплекта.Количество() = 0 Тогда
					
					Если НЕ Удаление  Тогда	
						
						//**  
						//Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно  Тогда
						//	Продолжить;
						//КонецЕсли;
						
						ОстатокПоЗаказу = Строка.Количество - КолНаЗакупку;
						
						Если ОстатокПоЗаказу <= 0 Тогда
							Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда
								Строка.ВариантОбеспечения  = Перечисления.ВариантыОбеспечения.КОбеспечению; //Требуется;
								Строка.Обособленно         = Истина;
							КонецЕсли;
							Строка._ЗаявкаНаЗакупку = ЗаявкаНаЗакупку.Ссылка;
							Продолжить;
						КонецЕсли;
						
						РазбитьСтрокуТЧЗаказа(ТоварыЗаказа, Строка, КолНаЗакупку, ПараметрыОбработки, СтруктураДействий);
						ОстатокПоЗаказу = 0;
						Строка._ЗаявкаНаЗакупку = ЗаявкаНаЗакупку.Ссылка; 
						ОбработанЗаказ = Истина;
					Иначе		//НЕ Удаление
						Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;			//Обособленно
						Строка._ЗаявкаНаЗакупку   = Документы.ЗаявкаНаЗакупку.ПустаяСсылка();
						Строка._УИДОтгрузка		  = Новый УникальныйИдентификатор();
						ОстатокПоЗаказу			  = Строка.Количество;
						ОбработанЗаказ			  = Ложь;
					КонецЕсли;		// НЕ Удаление 		 
					
				//Иначе
				//	ОстатокПоЗаказу = 0;
				//КонецЕсли;		//ТЗКомплекта.Количество() = 0
				
			КонецЦикла;		//Строка
			
			Если Удаление Тогда
				Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДЗаказ) Тогда
				СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, ВариантОбеспечения, _ЗаявкаНаЗакупку", тНоменклатура, ТекСтрока.Характеристика, Перечисления.ВариантыОбеспечения.НеТребуется, Документы.ЗаявкаНаЗакупку.ПустаяСсылка());
				Иначе			// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
					СтруктураДляПоиска = Новый Структура("ВариантОбеспечения, _УИДЗаказ", Перечисления.ВариантыОбеспечения.НеТребуется, ТекСтрока._УИДЗаказ);
				КонецЕсли;		// НЕ ЗначениеЗаполнено(ТекСтрока._УИД)
				
				СтрНоменклатуры = ТоварыЗаказа.НайтиСтроки(СтруктураДляПоиска);
				Если СтрНоменклатуры.Количество() > 1 Тогда
					ОбъеденитьстрокиТЧЗаказа(ТоварыЗаказа, ПараметрыОбработки, СтруктураДействий, СтруктураДляПоиска);
				КонецЕсли;
			КонецЕсли; 
			
			ТекСтрока.Количество = ОстатокПоЗаказу;
			
			
		КонецЦикла;		// ТекСтрока
		
		Если ( НЕ Удаление ) И ( ОбработанЗаказ = НЕОПРЕДЕЛЕНО ) Тогда
			ОбработанЗаказ = Истина;
		КонецЕсли;
		
		СформироватьЗаписиРегистра_ЗаказЗакупка(ЗаявкаНаЗакупку, КлючУникальности, Удаление, Истина, ОбработанЗаказ);
		
		_ДоработкиСлужебный.ЗаписатьДокументКлиента(ОбъектЗаказ, Истина);
		
	КонецЦикла;		// ТекЗаказ		
	
КонецПроцедуры	//ОбработкаЗаказов()

#КонецОбласти



#Область ОбработкаЗаявкиНаЗакупкуИзРабочегоСтола

&НаСервере
Процедура РазбитьСтрокиЗаявкиНаЗакупку(ДополнительныеПараметры) Экспорт
	
	ЗаявкаОбъект	= ДополнительныеПараметры.ТекЗаявка.ПолучитьОбъект();
	ТекСтрокаЗаявки	= ДополнительныеПараметры.СтрокаТовары - 1;
	ЗаказаноКол		= ДополнительныеПараметры.ЗаказаноКоличество;
	ОстатокПоЗаказу	= ДополнительныеПараметры.Остаток;
	УИДЗаказ		= ДополнительныеПараметры.УИДЗаказ;
	УИДЗакупка		= ДополнительныеПараметры.УИДЗакупка;
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЗаявкаОбъект);	

	РазбитьСтрокуТЧЗаявки(ЗаявкаОбъект.Товары, ТекСтрокаЗаявки, ОстатокПоЗаказу, ЗаказаноКол, Документы.ЗаказПоставщику.ПустаяСсылка(), СтруктураДействий, УИДЗаказ, УИДЗакупка, Ложь);
	_ДоработкиСлужебный.ЗаписатьДокументКлиента(ЗаявкаОбъект);
	ДополнительныеПараметры.Вставить("НовыяСтрока",Истина);

КонецПроцедуры	// РазбитьСтрокиЗаявкиНаЗакупку()

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Пересчитывает сумму товара в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - Структура - структура со свойствами строки документа.
//	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
//	КэшированныеЗначения - Структура - кэшированные значения.
//
Процедура ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий)

	ИмяКоличества = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСумму", ИмяКоличества) Тогда
		Если НЕ ЗначениеЗаполнено(ИмяКоличества) Тогда
			ИмяКоличества = "КоличествоУпаковок"
		Конецесли;
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока[ИмяКоличества];
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) 
	
	Перем СтруктураПараметровДействия;
	Перем СтавкаНДС;
	Перем НалогообложениеНДС;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС", СтруктураПараметровДействия) Тогда
		
		Если СтруктураПараметровДействия <> Неопределено И СтруктураПараметровДействия.Свойство("НалогообложениеНДС", НалогообложениеНДС) Тогда
			Если НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя") Тогда
				ТекущаяСтрока.СуммаНДС = 0;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если Не СтруктураПараметровДействия.Свойство("СтавкаНДС", СтавкаНДС) Тогда
			СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
		КонецЕсли;
		
		НДСпоСтавкам4и2 = СтруктураПараметровДействия <> Неопределено
				И СтруктураПараметровДействия.Свойство("НДСпоСтавкам4и2")
				И СтруктураПараметровДействия.НДСпоСтавкам4и2;
		
//**  		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС);
		ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, СтавкаНДС, СтруктураПараметровДействия.ЦенаВключаетНДС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Пересчитывает стоимость товара с НДС в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - Структура - структура со свойствами строки документа.
//	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
//	КэшированныеЗначения - Структура - кэшированные значения.
//
Процедура ПересчитатьСуммуСНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий)
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСНДС", СтруктураПараметровДействия) Тогда
		
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма + ?(СтруктураПараметровДействия.ЦенаВключаетНДС, 0, ТекущаяСтрока.СуммаНДС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Пересчитывает стоимость товара без НДС в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - Структура - структура со свойствами строки документа.
//	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
//
Процедура ПересчитатьСуммуБезНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий)
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуБезНДС") Тогда
		
		ТекущаяСтрока.СуммаБезНДС = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаНДС;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПустыхСтрокТЧ(ТЧ, СтруктураДляПоиска)
	ПустыеСтроки = ТЧ.НайтиСтроки(СтруктураДляПоиска);
	ТЗУдаленения = ТЧ.Выгрузить();
	ТЗУдаленения.Очистить();
	Для Каждого СтрокаМассива Из ПустыеСтроки Цикл
		НоваяСтрока = ТЗУдаленения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла;		// СтрокаУдаления Из 

	ТЗУдаленения.Сортировать("НомерСтроки Убыв"); 
	Для Стр = 0 По ТЗУдаленения.Количество() - 1 Цикл
		НомерУдаляемойстроки = ТЗУдаленения[Стр].НомерСтроки - 1;
		ТЧ.Удалить(НомерУдаляемойстроки);
	КонецЦикла;		// Стр
	
КонецПроцедуры	// ОбработкаПустыхСтрок()


#КонецОбласти
